In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
df=pd.DataFrame(randn(4,3),["A","B","C","D"],["Kolon1","Kolon2","Kolon3"])

In [6]:
df

     Kolon1    Kolon2    Kolon3
A -2.410381  0.924931 -1.113329
B -0.271926 -0.634828 -0.057505
C -0.413986  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [7]:
df > -1

   Kolon1  Kolon2  Kolon3
A   False    True   False
B    True    True    True
C    True    True    True
D    True    True    True

In [8]:
df>0

   Kolon1  Kolon2  Kolon3
A   False    True   False
B   False   False   False
C   False    True    True
D    True    True    True

In [12]:
booleanDf=df>0

In [13]:
booleanDf

   Kolon1  Kolon2  Kolon3
A   False    True   False
B   False   False   False
C   False    True    True
D    True    True    True

In [14]:
df[booleanDf]

     Kolon1    Kolon2    Kolon3
A       NaN  0.924931       NaN
B       NaN       NaN       NaN
C       NaN  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [15]:
df[df>0]  #df>0 değerleri filtreler

     Kolon1    Kolon2    Kolon3
A       NaN  0.924931       NaN
B       NaN       NaN       NaN
C       NaN  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [16]:
df["Kolon1"]

A   -2.410381
B   -0.271926
C   -0.413986
D    0.315817
Name: Kolon1, dtype: float64

In [17]:
df["Kolon1"]>0

A    False
B    False
C    False
D     True
Name: Kolon1, dtype: bool

In [20]:
df[df["Kolon1"]>0]  #df["Kolon1"]>0 değerleri filtreler.Yani false dönenleri filtreleyip True ları gösterir.
                    #İlk df değeri de bütün kolonları göstermesi talimatını verir.

     Kolon1    Kolon2    Kolon3
D  0.315817  0.795108  0.126387

In [33]:
df["Kolon1"]>-0.5

A    False
B     True
C     True
D     True
Name: Kolon1, dtype: bool

In [35]:
df[df["Kolon1"]>-0.5]  #Burada A false döndüğü için A yı filtreledi.

     Kolon1    Kolon2    Kolon3
B -0.271926 -0.634828 -0.057505
C -0.413986  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [38]:
df[df["Kolon3"]>0.1]

     Kolon1    Kolon2    Kolon3
C -0.413986  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [42]:
df[(df["Kolon1"]>-0.5) & (df["Kolon3"]>0.1)]   #BURADA & and anlamına gelir. df["Kolon1"]>-0.5 ve df["Kolon3"]>0.1 toplandı.
                                               #C VE D ORTAK OLDUĞU İÇİN C VE D Yİ YAZDIRDI

     Kolon1    Kolon2    Kolon3
C -0.413986  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [46]:
df[(df["Kolon1"]>-0.5) | (df["Kolon3"]>0.1)]#BURADA | or anlamına gelir. df["Kolon1"]>-0.5 veya olarak df["Kolon3"]>0.1 toplandı
                                            #Birisinde B,C,D DİĞERİNDE C,D OLDUĞU İÇİN B,C,D LER BASTIRILDI.
                                            #SADECE BİRİSİNDE A OLSAYDI A,B,C,D YAZDIRILACAKTI.

     Kolon1    Kolon2    Kolon3
B -0.271926 -0.634828 -0.057505
C -0.413986  0.010533  0.389517
D  0.315817  0.795108  0.126387

In [47]:
df["Kolon4"]=pd.Series(randn(4),["A","B","C","D"])

In [48]:
df

     Kolon1    Kolon2    Kolon3    Kolon4
A -2.410381  0.924931 -1.113329  1.359782
B -0.271926 -0.634828 -0.057505 -2.062629
C -0.413986  0.010533  0.389517 -1.211320
D  0.315817  0.795108  0.126387 -0.695271

In [51]:
df["Kolon5"]=randn(4)   #Numpy kullanarak newArray oluşturulur. Daha basit yolu.

In [52]:
df

     Kolon1    Kolon2    Kolon3    Kolon4    Kolon5
A -2.410381  0.924931 -1.113329  1.359782 -1.106142
B -0.271926 -0.634828 -0.057505 -2.062629  0.201996
C -0.413986  0.010533  0.389517 -1.211320  0.534029
D  0.315817  0.795108  0.126387 -0.695271 -0.678622

In [53]:
df["Kolon6"]=["newValue","newValue2","newValue3","newValue4"]

In [54]:
df

     Kolon1    Kolon2    Kolon3    Kolon4    Kolon5     Kolon6
A -2.410381  0.924931 -1.113329  1.359782 -1.106142   newValue
B -0.271926 -0.634828 -0.057505 -2.062629  0.201996  newValue2
C -0.413986  0.010533  0.389517 -1.211320  0.534029  newValue3
D  0.315817  0.795108  0.126387 -0.695271 -0.678622  newValue4

In [57]:
df.set_index("Kolon6")    #BURADA KOLON6 NIN DEĞERLERİ A,B,C,D İNDEKSİNİN YERİNE GEÇTİ VE BU İNDEKSLERİN İSMİ KOLON6 OLDU.

             Kolon1    Kolon2    Kolon3    Kolon4    Kolon5
Kolon6
newValue  -2.410381  0.924931 -1.113329  1.359782 -1.106142
newValue2 -0.271926 -0.634828 -0.057505 -2.062629  0.201996
newValue3 -0.413986  0.010533  0.389517 -1.211320  0.534029
newValue4  0.315817  0.795108  0.126387 -0.695271 -0.678622

In [59]:
df  #YUKARIDAKİ OLAY KALICI OLMADI BUNUN İÇİN inplace=True yapılmalı

     Kolon1    Kolon2    Kolon3    Kolon4    Kolon5     Kolon6
A -2.410381  0.924931 -1.113329  1.359782 -1.106142   newValue
B -0.271926 -0.634828 -0.057505 -2.062629  0.201996  newValue2
C -0.413986  0.010533  0.389517 -1.211320  0.534029  newValue3
D  0.315817  0.795108  0.126387 -0.695271 -0.678622  newValue4

In [62]:
df.set_index("Kolon6",inplace=True)  #Böylece index değişimi kalıcı oldu.
                                    #KOD TEKRAR ÇALIŞTIRILDIĞINDA HATA VERİR. DAHA ÖNCE DEĞİŞTİRİLDİĞİ İÇİN KOLON6 BULUNAMAZ...

KeyError: "None of ['Kolon6'] are in the columns"

In [63]:
df

             Kolon1    Kolon2    Kolon3    Kolon4    Kolon5
Kolon6
newValue  -2.410381  0.924931 -1.113329  1.359782 -1.106142
newValue2 -0.271926 -0.634828 -0.057505 -2.062629  0.201996
newValue3 -0.413986  0.010533  0.389517 -1.211320  0.534029
newValue4  0.315817  0.795108  0.126387 -0.695271 -0.678622

In [66]:
df.index.names   #Kaç tane index varsa isimlerini gösterir.

FrozenList(['Kolon6'])